age = 33      # เราแทนค่า age ด้วยตัวเลข33 ค่าที่แทนตรงนี้เป็นหน่วยที่เรียกว่า integer
temperature = 25.6 # ในส่วนของ temperature เราแทนค่าเป็นเลขที่มีจุดทศนิยม เรียกว่า Float
name = 'Jirath' # ส่วนของข้อความหรืออักษรต่างๆ จะต้องมี ('' หรือ "") ก่อนเพื่อระบุว่าเป็นข้อความ เราจะเรียกว่า string
is_male = True # ในส่วนนี้ คือการแทนค่า True หรือ False จะเรียกว่า Boolean

#ตัวอย่างที่ 1
x = 33
y = 22
z = x + y
print(z) 
 # ผลลัพธ์ที่ออกมา จะได้ค่าเป็นเลขตัวเต็ม หรือ integer

 #ตัวอย่างที่ 2 
x = 33
y = 22.2
z = x + y
print(z)
# ในตัวอย่าง ค่า x จะเป็น (integer) และ y (float) เมื่อนำค่าทั้ง2ตัวนี้มาบวกกันจะ ก็จะได้ผลลัพธ์ ที่ออกมาเป็น (float) เนื่องจากมีจุดทศนิยมเข้ามาเกี่ยวข้อง


#ตัวอย่างที่ 3
#ตอนแรกกำหนดให้ x = '33'
x = float('33') 
y = 22.2
z = x + y
print(z)
# ตัวอย่างนี้คือปัญหาของ data type error
# ค่าx เป็นข้อความ(string) กับ ค่าy(float) จะไม่สามารถบวกตัวเลขกันข้ามtypeได้ >จำเป็นต้องมีการแปลงค่าให้ตรงกันเพื่อจะสามารถบวกกันได้
# โดยเราสามารถเปลี่ยนค่า (string ให้กลายเป็น float/integer) โดยใช้คำสั่ง  x = float(33) แล้วเมื่อรันคำสั่งก็จะได้ผลลัพธ์ที่เป็น ค่า float
# หากไม่มีการแปลงค่า จะเกิดการ Error index - เนื่องจากdata type ไม่ถูกต้อง

#ตัวอย่างที่ 4
x = '33'
y = '22'
z = x + y
print(z)
#ตัวอย่างนี้ ค่า x และ y เป็น (string) ทั้งคู่ เมื่อนำข้อความทั้ง2 มารวมกัน จะเป็นการต่อข้อความกัน
