#ตัวอย่างที่1 - สัญลักษณ์ต่างๆ
x = 5
y = 2

example_1 = x + y    # บวก  = 7
example_2 = x - y    # ลบ   = 3
example_3 = x * y    # คูณ   = 10
example_4 = x / y    # หาร   = 2.5
example_5 = x % y    # ***เป็นการหาเศษที่ได้จากการหาร*** 5หาร2 = 2.5 ไม่ลงตัว(จะได้0.5) เพราะฉะนั้น จะได้ค่า   = 1
example_6 = x ** y   # ยกกำลัง   = 25
example_7 = x // y   # **เป็นการหาร แบบปัดเศษทิ้ง** คือ 5หาร2 = 2.5 เมื่อปัดเศษทิ้ง จะ   = 2
example_8 = (x + 1) * (y - 1)   # การใส่วงเล็บ เพื่อจัดกลุ่มในการคำนวน จะได้ค่าเป็น (5+1) * (2-1) = 6

print(example_1, example_2, example_3, example_4, example_5, example_6, example_7, example_8)


#ตัวอย่างที่2 - การใช้ += / -= / *= และ /=
x = 5
x = x + 2
print(x)
#เราแทนค่า x = 5 แต่เราอยากเพิ่มสมการ เข้าไปให้มีการบวกเพิ่มอีก2 ผลลัพธ์จะได้เท่ากับ 7
#แต่เราสามารถเขียนให้สั้นลงได้ด้วยการใช้ ( += )
x = 5
x += 2
print(x)



#ตัวอย่างที่3 - Boolean ผลลัพธ์ของการใช้สัญลักษณ์นี้ จะแสดงแค่ True / False
x = 8
y = 4

a1 = x > y   # x มีค่า มากกว่า y  คำตอบคือ ถูกต้อง = True
a2 = x >= y  # x มากกว่าหรือเท่ากับ y คำตอบคือ ถูกต้องครับ = True 

a3 = x < y   # x น้อยกว่า y คำตอบคือ ผิด = False
a4 = x <= y  # x น้อยกว่าหรือเท่ากับ y คำตอบคือ ผิด = False

a5 = x == y  # x มีค่าเท่ากับ y คำตอบคือ ผิด = False
a6 = x != y  # x มีค่าไม่เท่ากับ y คำตอบคือ ถูกต้อง = True

print(a1,a2,a3,a4,a5,a6)

#ตัวอย่างที่4 - เครื่องหมายตรรกศาสตร์ and,or, not - เพื่อบอกว่าค่านี้ถูกต้องไหม
p = True 
q = False

a1 = p and q  # ค่าp(True)กับค่าq(False) สมการคือ TrueกับFalse เป็นค่าเดียวกันไหม? คำตอบคือ ไม่เหมือนกัน ผลลัพธ์จึงออกมาเป็น False
a2 = p or q   # p(True)หรือq(False) ส่วนสมการนี้ จะดูว่า มีข้างใดข้างนึงเป็น True ไหม? ถ้ามี ผลลัพธ์คือ True
a3 = not p    # not p หรือ (True) **ตรงนี้คือการเปลี่ยนค่าของสถานะ จาก (True เป็น not True) ผลลัพธ์คือ False 
print(a1,a2,a3)