#loops - หรือคำสั่ง เพื่อใช้ในการทำซ้ำวนไป 
for i in range(1, 6): # (for ... in) เป็นการเริ่มloop และ (range) คือ[เริ่มต้น, จำนวนครั้ง]
    #*** ในส่วนของ range หากไม่กำหนดจุดเริ่มต้น มันจะนับจาก 0 ยาวไป 6 ครั้ง(ตามตัวอย่าง) จะได้เลข
    #0 1 2 3 4 5  - หรือก็คือ 6 ครั้ง
    print(i)


# ตัวอย่างที่1 
for i in range(1, 10): #เรากำหนด i ให้มี range(1, 10 รอบ) จะได้ เลข 1,2,3,4,5,6,7,8,9 (เราไม่ได้นับ0 เพราะ เริ่มจากตำแหน่งที่เลข 1)
    double = i*2 # ตรงนี้เราได้เพิ่มสมการ โดยเพิ่มคำสั่ง double = i คูณ 2 
    print(double) # ผลลัพธ์ คือ แสดงผลdouble ออกมาก ก็จะได้ i ที่ เลข 1-9 คูณ 2 ออกมา

# ตัวอย่างที่2 - การใช้ continue - ข้าม จนครบ loop
for i in range(1, 10): 
    if i % 3 == 0: # เคสนี้เราเพิ่มเงื่อนไขเข้าไป โดยกำหนดให้ หาก i หาร3 แล้วมีเศษออกได้เท่ากับ 0
        continue #ให้ทำการ *** ข้าม *** ตัวนั้น และ คำนวนต่อไปจนครบ loop
    print(i)

# ตัวอย่างที่3 - การใช้ Break - หยุด loop นั้นเลย
for i in range(1, 10):
    if i % 3 == 0: # หาก i หาร 3 แล้วเหลือเศษ เท่ากับ 0 ให้ทำการ
        break # หยุด loop ทันที
    print(i)