#หน้านี้จะเป็น module สำหรับ การเรียกใช้ function จากโปรเจ็คอื่นๆ สามารถดูได้ใน 7.ep module.py


# พื้นที่วงกลม
def get_circle_area(radius):  # สร้างฟังก์ชัน (def get_) ชื่อฟังก์ชันและต่อด้วยค่าที่ต้องการ
    return 22/7 * (radius ** 2)  # คำนวณสูตรพื้นที่วงกลม

# พื้นที่สามเหลี่ยม
def get_triangle_area(base, height):  # สร้างฟังก์ชันและพารามิเตอร์เพื่อคำนวณ
    return 1/2 * base * height  # คำนวณสูตรพื้นที่สามเหลี่ยม

# พื้นที่สี่เหลี่ยมผืนผ้า
def get_rectangle_area(base, height):  # สร้างฟังก์ชันและพารามิเตอร์เพื่อคำนวณ
    return base * height  # คำนวณสูตรพื้นที่สี่เหลี่ยมผืนผ้า

